import React, {useState} from 'react';
import Slide from "./Slide.jsx";
import {FaArrowLeft, FaArrowRight} from "react-icons/fa";

const SLIDES = [
    {
        id: 1,
        img: '/window.jpg',
        text: 'Сучасне рішення для вашого дому, яке поєднує в собі стиль, надійність і енергоефективність. Виготовляються з високоякісного полівінілхлориду, що забезпечує довговічність і мінімальний рівень обслуговування та відповідають найсучаснішим стандартам якості і безпеки, забезпечуючи оптимальну звуко- та теплоізоляцію. Вибір ПВХ вікон від "Візаж" — це крок до Вашого комфорту та економії енергоресурсів.',
        title: 'ПВХ вікна'
    },
    {
        id: 2,
        img: '/door.jpg',
        text: 'Сучасне рішення для вашого дому, яке поєднує в собі стиль, надійність і енергоефективність. Виготовляються з високоякісного полівінілхлориду, що забезпечує довговічність і мінімальний рівень обслуговування та відповідають найсучаснішим стандартам якості і безпеки, забезпечуючи оптимальну звуко- та теплоізоляцію. Вибір ПВХ вікон від "Візаж" — це крок до Вашого комфорту та економії енергоресурсів.',
        title: 'ПВХ двері'
    },{
        id: 3,
        img: '/garage.jpg',
        text: 'Сучасне рішення для вашого дому, яке поєднує в собі стиль, надійність і енергоефективність. Виготовляються з високоякісного полівінілхлориду, що забезпечує довговічність і мінімальний рівень обслуговування та відповідають найсучаснішим стандартам якості і безпеки, забезпечуючи оптимальну звуко- та теплоізоляцію. Вибір ПВХ вікон від "Візаж" — це крок до Вашого комфорту та економії енергоресурсів.',
        title: 'Секційні ворота'
    },{
        id: 4,
        img: '/loggia.jpg',
        text: 'Сучасне рішення для вашого дому, яке поєднує в собі стиль, надійність і енергоефективність. Виготовляються з високоякісного полівінілхлориду, що забезпечує довговічність і мінімальний рівень обслуговування та відповідають найсучаснішим стандартам якості і безпеки, забезпечуючи оптимальну звуко- та теплоізоляцію. Вибір ПВХ вікон від "Візаж" — це крок до Вашого комфорту та економії енергоресурсів.',
        title: 'ПВХ лоджії'
    },{
        id: 5,
        img: '/aluminium.jpg',
        text: 'Сучасне рішення для вашого дому, яке поєднує в собі стиль, надійність і енергоефективність. Виготовляються з високоякісного полівінілхлориду, що забезпечує довговічність і мінімальний рівень обслуговування та відповідають найсучаснішим стандартам якості і безпеки, забезпечуючи оптимальну звуко- та теплоізоляцію. Вибір ПВХ вікон від "Візаж" — це крок до Вашого комфорту та економії енергоресурсів.',
        title: 'Алюмінієві конструкції'
    },
]


const HeroSlider = () => {
    const [currentSlideIndex, setCurrentSlideIndex] = useState(0);
    const currentSlide = SLIDES[currentSlideIndex];


    function handleNextSlide(){
        setCurrentSlideIndex(prevIndex => prevIndex + 1 < SLIDES.length ? prevIndex + 1 :0);
    }

    function handlePrevSlide(){
        setCurrentSlideIndex(prevIndex => prevIndex - 1 < 0 ? SLIDES.length - 1 : prevIndex - 1);
    }


    return (
        <div className="relative w-full xl:h-[580px] 2xl:h-[780px] bg-amber-500 bg-white/80 rounded-lg overflow-hidden">
           <Slide {...currentSlide}/>
            <div className='absolute bottom-6 right-8 z-10 flex gap-10 text-5xl text-white '>
                <button onClick={handlePrevSlide} className='bg-slate-900/30 p-2 rounded-sm'><FaArrowLeft/></button>
                <button onClick={handleNextSlide} className='bg-slate-900/30 p-2 rounded-sm'><FaArrowRight/></button>
            </div>
        </div>
    );
};

export default HeroSlider;