import  {useEffect, useState} from 'react';
import Slide from "./Slide.jsx";
import {FaArrowLeft, FaArrowRight} from "react-icons/fa";

const SLIDES = [
    {
        id: 1,
        img: '/window.jpg',
        text: 'Сучасне рішення для вашого дому, яке поєднує в собі стиль, надійність і енергоефективність. Виготовляються з високоякісного полівінілхлориду, що забезпечує довговічність і мінімальний рівень обслуговування та відповідають найсучаснішим стандартам якості і безпеки, забезпечуючи оптимальну звуко- та теплоізоляцію. Вибір ПВХ вікон від "Візаж" — це крок до Вашого комфорту та економії енергоресурсів.',
        title: 'ПВХ вікна'
    },
    {
        id: 2,
        img: '/door.jpg',
        text: 'Ідеальне рішення для вашого житла, що поєднує в собі елегантний дизайн, надійність і високу енергоефективність. Виготовлені з високоякісного полівінілхлориду, вони гарантують тривалу службу і мінімальний рівень обслуговування. ПВХ двері відповідають сучасним стандартам якості і безпеці, забезпечуючи відмінну звукоізоляцію і теплоізоляцію. Вибір ПВХ дверей — це вибір комфорту і збереження енергоресурсів, який підкреслить індивідуальний стиль вашого будинку.',
        title: 'ПВХ двері'
    }, {
        id: 3,
        img: '/garage.jpg',
        text: 'Сучасне і практичне рішення для вашого гаражу або промислової будівлі. Вони поєднують у собі естетику, функціональність і високий рівень безпеки. Секційні ворота складаються з горизонтальних панелей, які плавно піднімаються вздовж стелі, забезпечуючи економію простору перед гаражем і оптимальну вентиляцію. Вони легкі у використанні і практичні в експлуатації, ідеально підходять для будь-яких умов і забезпечують надійний захист вашого майна.',
        title: 'Секційні ворота'
    }, {
        id: 4,
        img: '/loggia.jpg',
        text: 'Ідеальне рішення для вашого дому, що поєднує в собі стиль, комфорт і практичність. Виготовлені з високоякісного полівінілхлориду, вони забезпечують відмінну тепло- та звукоізоляцію, що робить їх ідеальними для використання у будь-яку пору року. ПВХ лоджії відрізняються довговічністю і мінімальним обслуговуванням, що робить їх надійним вибором для вашого житла.',
        title: 'ПВХ лоджії'
    }, {
        id: 5,
        img: '/aluminium.jpg',
        text: 'Алюмінієві конструкції є високоякісним і сучасним вибором для будь-якого будівельного проекту. Вони відзначаються легкістю, міцністю і стійкістю до корозії, що робить їх ідеальними для будівництва в промислових, комерційних і житлових об\'єктах. Алюмінієві конструкції відмінно підходять для створення великих скляних фасадів, віконних і дверних систем, дахів і веранд. Вони не тільки надійні і функціональні, але і дозволяють створювати сучасний і стильний дизайн з будь-якими архітектурними вимогами.',
        title: 'Алюмінієві конструкції'
    },
]


const HeroSlider = () => {
    const [currentSlideIndex, setCurrentSlideIndex] = useState(0);
    const currentSlide = SLIDES[currentSlideIndex];


    function handleNextSlide() {
        setCurrentSlideIndex(prevIndex => prevIndex + 1 < SLIDES.length ? prevIndex + 1 : 0);
    }

    function handlePrevSlide() {
        setCurrentSlideIndex(prevIndex => prevIndex - 1 < 0 ? SLIDES.length - 1 : prevIndex - 1);
    }

    useEffect(() => {
        const interval = setInterval(handleNextSlide, 10000);
        return () => {
            clearInterval(interval);
        }
    }, [currentSlideIndex])

    return (
        <div className="relative z-0 w-full h-[530px] xl:h-[580px] 2xl:h-[780px]  bg-white/80 rounded-lg overflow-auto ">
            <Slide {...currentSlide}/>
            <div className='absolute bottom-6 right-8 z-10 flex gap-10 text-5xl text-white '>
                <button onClick={handlePrevSlide}
                        className='bg-slate-900/30 p-2 rounded-sm hover:text-amber-600 hover:scale-110 duration-150'>
                    <FaArrowLeft/></button>
                <button onClick={handleNextSlide}
                        className='bg-slate-900/30 p-2 rounded-sm hover:text-amber-600 hover:scale-110 duration-150'>
                    <FaArrowRight/></button>
            </div>
        </div>
    );
};

export default HeroSlider;